# Path Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkConversionData..::..Path Property
LinkConversionData Class See Also
---
The path to the source data used to generate the model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace